In [4]:
import pandas as pd
import numpy as np
from statsmodels.stats.weightstats import ztest,ttest_ind

In [2]:
df=pd.read_csv('AB_Datasets\classroom_actions.csv')

In [7]:
df

                       timestamp      id       group  total_days  completed
0     2015-08-10 17:06:01.032740  610019  experiment          97       True
1     2015-08-10 17:15:28.950975  690224     control          75      False
2     2015-08-10 17:34:40.920384  564994  experiment         128       True
3     2015-08-10 17:50:39.847374  849588  experiment          66      False
4     2015-08-10 19:10:40.650599  849826  experiment          34      False
...                          ...     ...         ...         ...        ...
3824  2016-01-19 09:26:08.197754  364453  experiment          63      False
3825  2016-01-19 13:03:23.000822  519239     control          87       True
3826  2016-01-19 13:57:27.787897  508316  experiment         103       True
3827  2016-01-19 14:54:40.124679  244124     control          73      False
3828  2016-01-19 15:21:31.634379  511677  experiment          86       True

[3829 rows x 5 columns]

In [8]:
df[df['group']=='experiment']

                       timestamp      id       group  total_days  completed
0     2015-08-10 17:06:01.032740  610019  experiment          97       True
2     2015-08-10 17:34:40.920384  564994  experiment         128       True
3     2015-08-10 17:50:39.847374  849588  experiment          66      False
4     2015-08-10 19:10:40.650599  849826  experiment          34      False
8     2015-08-10 21:03:33.719529  929620  experiment          90      False
...                          ...     ...         ...         ...        ...
3818  2016-01-19 01:13:40.858762  522568  experiment         102       True
3820  2016-01-19 03:38:20.977586  819668  experiment          78       True
3824  2016-01-19 09:26:08.197754  364453  experiment          63      False
3826  2016-01-19 13:57:27.787897  508316  experiment         103       True
3828  2016-01-19 15:21:31.634379  511677  experiment          86       True

[2165 rows x 5 columns]

In [6]:
df[(df['group']=='experiment')&(df['total_days'].between(20,100))]

                       timestamp      id       group  total_days  completed
0     2015-08-10 17:06:01.032740  610019  experiment          97       True
3     2015-08-10 17:50:39.847374  849588  experiment          66      False
4     2015-08-10 19:10:40.650599  849826  experiment          34      False
8     2015-08-10 21:03:33.719529  929620  experiment          90      False
9     2015-08-10 22:47:00.254898  512761  experiment          59      False
...                          ...     ...         ...         ...        ...
3814  2016-01-18 18:02:47.824759  569326  experiment          87       True
3816  2016-01-18 21:16:17.809510  877425  experiment          57      False
3820  2016-01-19 03:38:20.977586  819668  experiment          78       True
3824  2016-01-19 09:26:08.197754  364453  experiment          63      False
3828  2016-01-19 15:21:31.634379  511677  experiment          86       True

[1856 rows x 5 columns]

In [9]:
df[(df['group']=='experiment')|(df['total_days'].between(20,100))]

                       timestamp      id       group  total_days  completed
0     2015-08-10 17:06:01.032740  610019  experiment          97       True
1     2015-08-10 17:15:28.950975  690224     control          75      False
2     2015-08-10 17:34:40.920384  564994  experiment         128       True
3     2015-08-10 17:50:39.847374  849588  experiment          66      False
4     2015-08-10 19:10:40.650599  849826  experiment          34      False
...                          ...     ...         ...         ...        ...
3824  2016-01-19 09:26:08.197754  364453  experiment          63      False
3825  2016-01-19 13:03:23.000822  519239     control          87       True
3826  2016-01-19 13:57:27.787897  508316  experiment         103       True
3827  2016-01-19 14:54:40.124679  244124     control          73      False
3828  2016-01-19 15:21:31.634379  511677  experiment          86       True

[3620 rows x 5 columns]

In [11]:
df[~(df['total_days'].between(20,100))]

                       timestamp      id       group  total_days  completed
2     2015-08-10 17:34:40.920384  564994  experiment         128       True
19    2015-08-11 09:11:17.442981  588165     control         102       True
27    2015-08-11 15:56:14.996717  526527  experiment         113       True
28    2015-08-11 17:25:18.907427  545500  experiment         107       True
33    2015-08-11 20:27:40.363932  305859  experiment         102       True
...                          ...     ...         ...         ...        ...
3778  2016-01-17 13:26:16.875725  518321  experiment         101       True
3786  2016-01-17 22:04:50.717238  836444  experiment         109       True
3789  2016-01-17 23:53:52.254677  192084     control         109       True
3818  2016-01-19 01:13:40.858762  522568  experiment         102       True
3826  2016-01-19 13:57:27.787897  508316  experiment         103       True

[518 rows x 5 columns]

In [16]:
df[(df['group']=='experiment')].total_days.mean()

74.6715935334873

In [17]:
df[df['group']=='control'].total_days.mean()

73.36899038461539

In [20]:
# HA: > M
# H0: =<M

In [21]:
ztest(df[df['group']=='experiment'].total_days,df[df['group']=='control'].total_days,alternative='larger')

(1.784221674871853, 0.037193825815102055)

In [22]:
ttest_ind(df[df['group']=='experiment'].total_days,df[df['group']=='control'].total_days,alternative='larger')

(1.784221674871853, 0.03723342678032586, 3827.0)

## Pandas

In [24]:
df=pd.read_csv('data\Restaurant_Reviews.tsv',sep='\t')
df

                                                Review  Liked
0                             Wow... Loved this place.      1
1                                   Crust is not good.      0
2            Not tasty and the texture was just nasty.      0
3    Stopped by during the late May bank holiday of...      1
4    The selection on the menu was great and so wer...      1
..                                                 ...    ...
995  I think food should have flavor and texture an...      0
996                           Appetite instantly gone.      0
997  Overall I was not impressed and would not go b...      0
998  The whole experience was underwhelming, and I ...      0
999  Then, as if I hadn't wasted enough of my life ...      0

[1000 rows x 2 columns]

In [25]:
ser=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [26]:
ser1=pd.Series(['a','b','c','d','e'])
ser1

0    a
1    b
2    c
3    d
4    e
dtype: object

In [27]:
ser1[0]

'a'

In [28]:
ser1*3

0    aaa
1    bbb
2    ccc
3    ddd
4    eee
dtype: object

In [29]:
ser*3

a     3
b     6
c     9
d    12
e    15
dtype: int64

In [30]:
ser+4

a    5
b    6
c    7
d    8
e    9
dtype: int64

In [32]:
data=np.random.randn(4,5)
data

array([[-0.20751317,  0.62670088,  0.75080656, -1.74072759, -0.44793311],
       [ 0.52970114, -0.29643721,  1.62427767,  1.33618274,  0.64647766],
       [-1.47806447,  0.7125418 ,  1.35625657,  1.20320019, -0.6243318 ],
       [-2.22798274, -0.72381322, -0.35367221,  0.06841702, -0.35688072]])

In [33]:
df=pd.DataFrame(data,columns=['col1','col2','col3','col4','col5'])
df

       col1      col2      col3      col4      col5
0 -0.207513  0.626701  0.750807 -1.740728 -0.447933
1  0.529701 -0.296437  1.624278  1.336183  0.646478
2 -1.478064  0.712542  1.356257  1.203200 -0.624332
3 -2.227983 -0.723813 -0.353672  0.068417 -0.356881

In [34]:
df['col2']

0    0.626701
1   -0.296437
2    0.712542
3   -0.723813
Name: col2, dtype: float64

In [35]:
df[['col1','col4']]

       col1      col4
0 -0.207513 -1.740728
1  0.529701  1.336183
2 -1.478064  1.203200
3 -2.227983  0.068417

In [36]:
df['col2'].apply(lambda x: x**2)

0    0.392754
1    0.087875
2    0.507716
3    0.523906
Name: col2, dtype: float64